Tekla Open API Reference for Tekla Structures 2025
ShapeItem.HandlePoints Property
 Defines handle points of the shape.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public List<Point> HandlePoints { get; set; }
Public Property HandlePoints As List(Of Point)
	Get
	Set
Property Value
Type: List<Point>
See Also
Reference
ShapeItem Class
Tekla.Structures.Catalogs Namespace